# 1) sequence: კოდი სრულდება ზემოდან ქვემოთ თანმიმდევრობით.
# რეალური მაგალითი: დილით გაღვიძება, მომზადება, სკოლაში წასვლა.
# selection: პროგრამა ამოწმებს პირობას და მაგის მიხედვით იღებს გადაწყვეტილებას.
# რეალური მაგალითი: თუ წვიმს ქოლგა წაიღე, თუ არ წვიმს ქოლგა არ გჭირდება.
# iteration: ერთი და იგივე მოქმედება რამდენჯერმე სრულდება.
# რეალური მაგალითი: დარბაზში 10-ჯერ აზიდვა.

# 2)
for i in range(1, 101, 2):
    print(i)

# 3)
for i in range(101, 201, 2):
    print(i)

# 4)
for i in range(5):
    age = int(input("შეიყვანე ასაკი: "))

    if age == 18:
        print("მომხმარებელი არის 18 წლის")

    if age != 18:
        print("მომხმარებელი არ არის 18 წლის")

# 5)
surname = "მინაშვილი"

for letter in surname:
    print(letter, surname)