# 1) explicit არის როდესაც ჩვენ ხელით ვცვლით მონაცემთა ტიპს. 
# implicit არის როდესაც მონაცემთა ტიპი იცვლება ავტომატურად.

# 2) 
age = int(input("შეიყვანე შენი ასაკი: "))
print("10 წელში იქმენი: " , age + 10)

# 3) ეს კოდი გამოიტანს 2 -ს 

# 4) ამ კოდით მივიგებთ 16 -ს , რადგან true = 1 , false = 0. ამოხსნას ვიწყებთ შიგნიდან ანუ : 
# true + 1 = 1 + 1 = 2 , str(2) = "2" , "2" * 2 = "22" , int("22") = 22 , float("5") = 5.0 ,
# int(5.0) = 5 , და ახლა უნდა ჩავსვათ, false - 22 + true + 5 , 0 - 22 + 1 + 5 , 
# 0 - 22 = -22 , -22 + 1 = 21 , 21 + 5 = 16


