print("day 01 homework")

# 5) კომენტარი არის ტექსტი რომელსაც პროგრამა ვერ კითხულობს.ეს საჭიროა იმისათვის, რომ ავხსნათ თუ რას აკეთებს კოდი.

# 6) ფაილის გაფართოება არის ფაილის ტიპი. Python ფაილი იქმნება როდესაც ვქმნით ახალ ფაილს და ბოლოს ვუწერთ .py .

# 7) Print() გამოიყენება იმისათვის, რომ ეკრანზე რამე დავბეჭდოთ.

# 8) Terminal ში ვუშვებთ პროგრამას და ვხედავთ რა შედეგი გამოიტანა.

print("Nini")
print("Minashvili")
print(14)

print("Maze runner")
print("Fight club")
print("Honey")
print("F1")
print("Outer banks")

print("Nini" * 14)

print(14 + 5)